{"backend": "tensorflow", "config": {"layers": [{"config": {"dtype": "float32", "bias_constraint": null, "batch_input_shape": [null, 300, 300, 3], "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "filters": 16, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "padding": "valid", "trainable": true, "kernel_regularizer": null, "name": "conv2d", "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d", "pool_size": [2, 2], "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "filters": 32, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "trainable": true, "kernel_regularizer": null, "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "filters": 64, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "trainable": true, "kernel_regularizer": null, "name": "conv2d_2", "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "filters": 64, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "trainable": true, "kernel_regularizer": null, "name": "conv2d_3", "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "filters": 64, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "trainable": true, "kernel_regularizer": null, "name": "conv2d_4", "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last", "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "units": 512, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "name": "dense", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "units": 5, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}], "name": "sequential"}, "keras_version": "2.2.4-tf", "class_name": "Sequential"}